Repository: eduzen/website
Catalog: blog/locale/*/LC_MESSAGES/django.po
Languages: es

source: word
es: palabra

source: tag
es: etiqueta

source: tags
es: etiquetas

source: A bit more about me 😉, so here it goes:
es: Un poco más sobre mi 😉, así que aquí va:

source: I'm <span x-bind:class="randomColor()">Eduardo Enriquez</span>, aka <span x-bind:class="randomColor()">eduzen</span>. I've been working in the <span x-bind:class="randomColor()">IT industry</span> for quite a long time, %(years)s years and counting, mostly as a backend <span x-bind:class="randomColor()">developer</span> 💻. But I also have some <span x-bind:class="randomColor()">experience</span> working as a <span x-bind:class="randomColor()">team leader</span>. <span x-bind:class="randomColor()">Python</span> 🐍, <span x-bind:class="randomColor()">Django</span> 🟩, and <span x-bind:class="randomColor()">Flask</span> are the main <span x-bind:class="randomColor()">technologies</span> 🧪 that I've been working with. Naturally, I have some <span x-bind:class="randomColor()">experience</span> 💡 with other things like <span x-bind:class="randomColor()">Javascript</span>, <span x-bind:class="randomColor()">Docker</span> 🐳, <span x-bind:class="randomColor()">Redis</span> 🟥, <span x-bind:class="randomColor()">RabbitMQ</span> 🐰, <span x-bind:class="randomColor()">Celery</span> 🌿, and <span x-bind:class="randomColor()">Linux 🐧</span>.
es: Soy <span x-bind:class="randomColor()">Eduardo Enríquez</span>, también conocido como <span x-bind:class="randomColor()">eduzen</span>. He estado trabajando en la industria de <span x-bind:class="randomColor()">TI</span> durante bastante tiempo, %(years)s años y contando, principalmente como desarrollador <span x-bind:class="randomColor()">backend</span> 💻. Pero también tengo algo de <span x-bind:class="randomColor()">experiencia</span> trabajando como <span x-bind:class="randomColor()">líder de equipo</span>. <span x-bind:class="randomColor()">Python</span> 🐍, <span x-bind:class="randomColor()">Django</span> 🟩 y <span x-bind:class="randomColor()">Flask</span> son las principales <span x-bind:class="randomColor()">tecnologías</span> 🧪 con las que he estado trabajando. Naturalmente, tengo algo de <span x-bind:class="randomColor()">experiencia</span> 💡 con otras cosas como <span x-bind:class="randomColor()">Javascript</span>, <span x-bind:class="randomColor()">Docker</span> 🐳, <span x-bind:class="randomColor()">Redis</span> 🟥, <span x-bind:class="randomColor()">RabbitMQ</span> 🐰, <span x-bind:class="randomColor()">Celery</span> 🌿 y <span x-bind:class="randomColor()">Linux 🐧</span>.

source: You can check my code at <a class="text-green-400 nav-link" href="https://github.com/eduzen/">https://github.com/eduzen/</a>. There you can find some <span x-bind:class="randomColor()">bots</span> like the one that I have for <span x-bind:class="randomColor()">Telegram</span>, <a class="text-green-400 nav-link" href="https://github.com/eduzen/bot">eduzen_bot</a> 🤖 (you can talk to it following this link: <a class="text-green-400 nav-link" href="https://t.me/eduzen_bot"> bot </a>). Or you can find the <span x-bind:class="randomColor()">source code</span> of this website at <a class="text-green-400 nav-link" href="https://github.com/eduzen/website">https://github.com/eduzen/website</a>.
es: Puedes revisar mi código en <a class="text-green-400 nav-link" href="https://github.com/eduzen/">https://github.com/eduzen/</a>. Allí puedes encontrar algunos <span x-bind:class="randomColor()">bots</span> como el que tengo para <span x-bind:class="randomColor()">Telegram</span>, <a class="text-green-400 nav-link" href="https://github.com/eduzen/bot">eduzen_bot</a> 🤖 (puedes hablar con él siguiendo este enlace: <a class="text-green-400 nav-link" href="https://t.me/eduzen_bot"> bot </a>). O puedes encontrar el <span x-bind:class="randomColor()">código fuente</span> de este sitio web en <a class="text-green-400 nav-link" href="https://github.com/eduzen/website">https://github.com/eduzen/website</a>.

source: Besides computers, I like <span x-bind:class="randomColor()">good music</span>, books, <span x-bind:class="randomColor()">philosophy</span>, <span x-bind:class="randomColor()">movies</span>, <span x-bind:class="randomColor()">series</span>, and good <span x-bind:class="randomColor()">food</span>. I started trying some <span x-bind:class="randomColor()">me</span><span x-bind:class="randomColor()">ch</span><span x-bind:class="randomColor()">an</span><span x-bind:class="randomColor()">ic</span><span x-bind:class="randomColor()">al</span> keyboards (right now using a Leo pold 75 %%)! But I have also a Keychron K12.
es: Además de las computadoras, me gusta la <span x-bind:class="randomColor()">buena música</span>, los libros, la <span x-bind:class="randomColor()">filosofía</span>, las <span x-bind:class="randomColor()">películas</span>, las <span x-bind:class="randomColor()">series</span> y la buena <span x-bind:class="randomColor()">comida</span>. Comencé a probar algunos <span x-bind:class="randomColor()">teclados</span> <span x-bind:class="randomColor()">mecánicos</span> (¡actualmente uso un Leo pold 75 %%)! Pero también tengo un Keychron K12.

source: Some people find it weird that I have a <span x-bind:class="randomColor()">bachelor's</span> degree in <span x-bind:class="randomColor()">philosophy</span> from the University of Buenos Aires 🇦🇷. But I think that <span x-bind:class="randomColor()">rational</span> thinking is something that my profession and studies share. In general, philosophy has shaped my <span x-bind:class="randomColor()">analytical</span> thinking and fostered my <span x-bind:class="randomColor()">curiosity</span>. Some of my favorite philosophers are <span x-bind:class="randomColor()">Nietzsche</span>, <span x-bind:class="randomColor()">Descartes</span>, and <span x-bind:class="randomColor()">Foucault</span>. Writers... many; <span x-bind:class="randomColor()">Jorge Luis Borges</span>, <span x-bind:class="randomColor()">Ursula K. Le Guin</span>, <span x-bind:class="randomColor()">Arthur C. Clarke</span>, and many more...
es: Algunas personas encuentran extraño que tenga una licenciatura en <span x-bind:class="randomColor()">filosofía</span> de la Universidad de Buenos Aires 🇦🇷. Pero creo que el pensamiento <span x-bind:class="randomColor()">racional</span> es algo que comparte mi profesión y mis estudios. En general, la filosofía ha moldeado mi pensamiento <span x-bind:class="randomColor()">analítico</span> y fomentado mi <span x-bind:class="randomColor()">curiosidad</span>. Algunos de mis filósofos favoritos son <span x-bind:class="randomColor()">Nietzsche</span>, <span x-bind:class="randomColor()">Descartes</span> y <span x-bind:class="randomColor()">Foucault</span>. Escritores... muchos; <span x-bind:class="randomColor()">Jorge Luis Borges</span>, <span x-bind:class="randomColor()">Ursula K. Le Guin</span>, <span x-bind:class="randomColor()">Arthur C. Clarke</span>, y muchos más...

source: Last but not least, I'm passionate about <span x-bind:class="randomColor()">teaching</span> 👨🏽‍🏫. I think my background in <span x-bind:class="randomColor()">philosophy</span> has helped me to be a <span x-bind:class="randomColor()">better</span> teacher. I've been <span x-bind:class="randomColor()">teaching in the past</span>, and I'm looking <span x-bind:class="randomColor()">forward</span> to doing it more often in the IT <span x-bind:class="randomColor()">field</span>.
es: Por último pero no menos importante, soy apasionado por la <span x-bind:class="randomColor()">enseñanza</span> 👨🏽‍🏫. Creo que mi formación en <span x-bind:class="randomColor()">filosofía</span> me ha ayudado a ser un <span x-bind:class="randomColor()">mejor</span> profesor. He estado <span x-bind:class="randomColor()">enseñando en el pasado</span>, y estoy deseando <span x-bind:class="randomColor()">hacerlo más a menudo en el campo de la <span x-bind:class="randomColor()">TI</span>.</span>

source: If you want to contact me, you can do it through <a class="text-green-400 nav-link" href="/contact/">this form</a> or through my <a class="text-green-400 nav-link" href="https://www.linkedin.com/in/eduzen/">LinkedIn</a>.
es: Si deseas contactarme, puedes hacerlo a través de <a class="text-green-400 nav-link" href="/contact/">este formulario</a> o a través de mi <a class="text-text-green-400-500 nav-link" href="https://www.linkedin.com/in/eduzen/">LinkedIn</a>.

source: Advance Search
es: Busqueda avanzada

source: No results
es: No hay ningun resultado 😞

source: How-to-look
es: Por favor 🙏 realize de nuevo la búsqueda!

source: Classes
es: Clases

source: here
es: aquí

source: My goal as a teacher is not just to impart knowledge, but to inspire and guide you in a way that you can lose me (and be independent) in your learning journey.
es: Mi objetivo como profesor no es solo impartir conocimiento, sino inspirar y guiarte de namera tal que puedas perderme (y ser independiente) en tu viaje de aprendizaje.

source: We can learn about:
es: Podemos aprender sobre:

source: or about web frameworks like
es: o sobre frameworks web como

source: We can also explore other topics like:
es: También podemos explorar otros temas como:

source: or the one that you need.
es: o el que necesites.

source: It's not easy to learn new things. It's hard also to find the motivation and the resources that are good for you. In these modern times, what we have is data 🗃️, data 🗃️ and data 🗃️, available everywhere.
es: No es fácil aprender cosas nuevas. También es difícil encontrar la motivación y los recursos que sean buenos para ti. En estos tiempos modernos, lo que tenemos es datos 🗃️, datos 🗃️ y más datos 🗃️, disponibles en todas partes.

source: However, discerning the quality of this data can be challenging. That's where a guide or companion comes in handy 😉.
es: Sin embargo, discernir la calidad de estos datos puede ser un desafío. Ahí es donde un guía o compañero resulta útil 😉.

source: So I can help you to organize and curate the data and tell you what to use or not.
es: Así que puedo ayudarte a organizar y curar los datos y decirte qué usar o qué no.

source: Reach out to me here
es: Contáctame aquí

source: here
es: aquí

source: or drop me an email at
es: o envíame un correo a

source: and let's chat!
es: y hablemos!

source: If you're in the Netherlands 🇳🇱, let's schedule a coffee ☕ and chat 💬 about your learning objectives. If you're based elsewhere in the world 🌍, not to worry!
es: Si estás en Holanda 🇳🇱, vamos por un café ☕ y hablemos 💬 sobre tus planes y objectivos. Si estás en otro lugar del mundo 🌍, no te preocupes!

source: We can set up a Zoom or Meet call to discuss how I can assist you in your coding adventure.
es: Podemos organizar una call por Zoom o Meet para discutir cómo puedo asistirte en tu aventura de programación.

source: Online Resources to Learn Python:
es: Recursos en línea para aprender Python:

source: Impossible not to recommend ChatGPT
es: Imposible no recomendar ChatGPT

source: I think it's one of the most important resources from our modern times. It's a great companion that could answer almost everything that you need in this field.
es: Creo que es uno de los recursos más importantes de nuestros tiempos modernos. Es un gran compañero que podría responder casi todo lo que necesitas en este campo.

source: Certainly it's not infallible, it has its caveats and you need to learn how to use it. But it's worthy. I'm using it every day.
es: Ciertamente no es infalible, tiene sus matices y necesitas aprender cómo usarlo. Pero vale la pena. Lo uso todos los días.

source: Consultancy Services
es: Servicios de Consultoria

source: Contact Me
es: Contacto

source: Contact
es: Contacto

source: Are you sure?
es: Estas seguro?

source: What color is the red rabbit?
es: De que color es el conejo rojo?

source: Please try again later... or contact me
es: Por favor intente mas tarde... o contacteme

source: First
es: Primer

source: Previous
es: Anterior

source: Next
es: Siguiente

source: Last
es: Ultimo

source: Nothing yet!
es: Todavia nada!

source: Consultancy
es: Consultoria

source: Based in Amsterdam
es: Ubicado en Amsterdam

source: available
es: disponible

source: everywhere!
es: en cualquier lugar!

source: Author
es: Autor

source: Related posts
es: Notas relacionadas

source: Published
es: Publicado

source: or just public notes
es: o solo notas publicas

source: Thank you for your message
es: Gracias por tu mensaje

source: We are going to reply you soon!
es: Te responderemos pronto!

source: Made with 💜 by Eduardo Enriquez
es: Hecho con 💜 por Eduardo Enriquez

source: description
es: descripcion

source: About
es: Acerca

source: English
es: Ingles

source: Spanish
es: Español
